{
  "basics": {
    "name": "John Hurliman",
    "label": "Product and Technology Executive",
    "picture": "https://i.imgur.com/nfgtq7D.png",
    "email": "jhurliman@jhurliman.org",
    "phone": "(415) 271-6485",
    "website": "http://jhurliman.org/",
    "summary": "John has led software engineering teams in both corporate and open source roles since 1999. A veteran of peer-to-peer, large scale networking, massively multi-person simulations, machine learning, and consumer web+mobile technology, his work has been covered by the Wall Street Journal, New York Times, and Forbes. His research has been presented at the Internet Engineering Task Force, at the International Symposium on Computer Architecture, and as the keynote of Supercomputing 2009. He has most recently overseen product vision and technical architecture for the next generation of video entertainment, user generated content, and social networking platforms in early to mid stage startups.",
    "profiles": [{
      "network": "Twitter",
      "username": "jhurliman",
      "url": "https://twitter.com/jhurliman"
    },
    {
      "network": "Facebook",
      "username": "john.hurliman",
      "url": "https://www.facebook.com/john.hurliman"
    },
    {
      "network": "GitHub",
      "username": "jhurliman",
      "url": "https://github.com/jhurliman/"
    }]
  },
  "work": [{
    "company": "THRED",
    "position": "CTO",
    "website": "https://thredhq.com/",
    "startDate": "2013-07-01",
    "endDate": "2015-08-01",
    "summary": "THRED is a visual micro-blogging platform that allows regular people to express themselves in a new format designed for mobile. Founded by legendary designer Will Wright and backed by Andreessen Horowitz, THRED launched in May 2015.",
    "highlights": [
      "Hired and led engineering, operations, and analytics teams to ship on scope with regular two week updates, provide four nines of uptime, and provide real-time and weekly aggregate analytic reports from our custom data warehouse.",
      "Transitioned from R&D to shipping a polished and well received iOS app within 5 months.",
      "Interim head of product from February 2014 - May 2015.",
      "Featured by Apple in the App Store as Best New App and as Best Blogging App."
    ]
  },
  {
    "company": "MOX",
    "position": "CTO & Head of Product",
    "website": "http://mox.tv/",
    "startDate": "2012-09-01",
    "endDate": "2013-11-01",
    "summary": "MOX TV is music television for the 21st century. Featuring a lean-back 24/7 channel and a deep archive of content available through web and mobile, MOX TV is filmed in Hollywood, Manhattan, and on-location across the globe.",
    "highlights": [
      "Worked with design, marketing, and studio heads to turn the CEO's vision into branded destinations on web and mobile in 6 months, launching live at Winter Music Conference to 100k viewers.",
      "Designed a novel streaming architecture for stitching pre-recorded and live content together via a programmable schedule.",
      "Built a video pipeline supporting third party uploads, collaborative editing between Hollywood and Manhattan studios, tape archiving, and publishing to the Amazon cloud.",
      "Extended our analytics with video heatmaps and real-time aggregations using probabilistic data structures."
    ]
  },
  {
    "company": "Cull TV",
    "position": "CTO & Co-Founder",
    "website": "https://www.crunchbase.com/organization/cull-tv",
    "startDate": "2011-01-01",
    "endDate": "2012-09-01",
    "summary": "Cull TV was a music video curation startup that used machine learning to deliver personalized recommendations to audiences on web and Google TV. Cull TV was acquired for its real-time recommendation engine by MOX TV in September 2012.",
    "highlights": [
      "Bootstrapped from concept to market within 4 months and through word of mouth, grew to 50k active users within a month.",
      "Worked with Dr. Charles Elkan to design and implement a real-time recommendation engine tuned for collaborative filtering of long tail content.",
      "Covered by The New York Times, GigaOM, Forbes, and more. Hailed as MTV for the digital generation."
    ]
  },
  {
    "company": "Telly",
    "position": "Senior Software Engineer",
    "website": "http://telly.com/",
    "startDate": "2012-05-01",
    "endDate": "2012-09-01",
    "summary": "Telly is a video sharing portal that enables its users to upload personal videos and discover trending video content.",
    "highlights": [
      "Built machine learning solutions for friend recommendations using Personalized PageRank.",
      "Improved automatic thumbnail selection using a 10-factor image heuristic model.",
      "Implemented and deployed a web crawling cluster for surfacing trending and newsworthy videos across the Internet.",
      "Designed and deployed a real-time social activity feed handling peaks of 500k concurrent visitors."
    ]
  },
  {
    "company": "Intel Corporation",
    "position": "Software Research Engineer",
    "website": "http://www.intel.com/",
    "startDate": "2008-07-01",
    "endDate": "2011-01-01",
    "summary": "The virtual worlds infrastructure research group in Intel Labs published findings in large heterogeneous simulation platforms.",
    "highlights": [
      "Co-developed an architecture for scaling real-time collaborative simulations to 1000s of concurrent users, using techniques from common three-tier web architectures. This research was presented as the Supercomputing 2009 keynote by Intel's CTO, Justin Rattner.",
      "Handled public relations across corporate partners, open source communities, presented at academic conferences, and represented Intel in the IETF standards process.",
      "Optimized the OpenSimulator platform over the course of 3 months to increase scene complexity 10x past the commercial Second Life platform, improve physics accuracy, and significantly reduced memory footprint."
    ]
  },
  {
    "company": "Open Metaverse Foundation / Metaverse Industries LLC",
    "position": "Founder",
    "website": "https://github.com/openmetaversefoundation",
    "startDate": "2006-04-01",
    "endDate": "2011-01-01",
    "summary": "What started with Wireshark, a disassembler, and a desire to bring AI into the Second Life world turned into a five year development effort by over 30 people to create one of the largest and most active open source C# projects at the time.",
    "highlights": [
      "Turned a personal project into leading a talented team of 30+ software engineers and reverse engineers that produced 120k lines of code powering AI, virtual world automation, Linden Lab's unit testing, and ultimately the OpenSimulator platform.",
      "Founded Metaverse Industries LLC to help brands, musicians, and digital marketing agencies orchestrate virtual concerts, connect mobile devices in-world, and run interactive campaigns."
    ]
  },
  {
    "company": "ESP Worldwide",
    "position": "Lead Developer",
    "website": "http://espians.com/",
    "startDate": "1999-07-01",
    "endDate": "2001-07-01",
    "summary": "ESP turned promising new fields of computing into usable experiences, from micro-payments to peer-to-peer computing.",
    "highlights": [
      "Led a team of three engineers to build Espra, a visually intuitive peer-to-peer filesharing interface on top of the cryptographically hardened Freenet system.",
      "Handled public relations for Espra both online and offline, unveiling the product at the O'Reilly Peer-to-Peer Conference in 2001."
    ]
  }],
  "education": [{
    "institution": "Washington State University",
    "area": "College of Business and Economics",
    "studyType": "Bachelor",
    "startDate": "2003-08-01",
    "endDate": "2007-05-01"
  }],
  "publications": [{
    "name": "Speaking Event: Introducing Cull TV",
    "publisher": "NodeJam Startup Competition @ NodeSummit. San Francisco, CA",
    "releaseDate": "2012-01-01",
    "website": "http://nodesummit.com/events/sf2012/nodejam/"
  },
  {
    "name": "H. Liu, M. Bowman, R. Adams, J. Hurliman, and D. Lake. Scaling virtual worlds: Simulation requirements and challenges",
    "publisher": "In Proceedings of Winter Simulation Conference",
    "releaseDate": "2010-12-01",
    "website": "http://www.informs-sim.org/wsc10papers/070.pdf"
  },
  {
    "name": "C. M. Bowman, D. Lake, and J. Hurliman. Designing Extensible and Scalable Virtual World Platforms",
    "publisher": "Extensible Virtual Worlds Workshop (X10)",
    "releaseDate": "2010-10-01",
    "website": "https://software.intel.com/en-us/articles/scalable-virtual-environments"
  },
  {
    "name": "J. Hurliman, H. Liu, and M. Bowman. Application of Many-Core Architecture to Virtual World Workloads",
    "publisher": "Emerging Applications and Many-Core Architecture (EAMA), International Symposium on Computer Architecture",
    "releaseDate": "2010-06-01",
    "website": "https://sites.google.com/site/eamaworkshop/2010-program/2010-program"
  },
  {
    "name": "Speaking Event: Cable Beach and VWRAP",
    "publisher": "Internet Engineering Task Force 77. Anaheim, CA",
    "releaseDate": "2010-03-01",
    "website": "https://www.ietf.org/proceedings/77/slides/vwrap-8.pdf"
  },
  {
    "name": "Speaking Event: Cable Beach: A Service-Based Virtual World Architecture",
    "publisher": "Metaverse U. Stanford, Palo Alto, CA",
    "releaseDate": "2009-05-01",
    "website": "http://www.academia.edu/1244426/Metaverse_U_2.0_Conference_Notes"
  },
  {
    "name": "Speaking Event: Open Source Track",
    "publisher": "Second Life Community Convention. Chicago, IL",
    "releaseDate": "2007-08-01",
    "website": "http://www.slconvention.org/2010/program/conference-tracks/technical-opensource/"
  },
  {
    "name": "J. Hurliman. Virtual Appraisals: A Hedonic Pricing Model of Property in Second Life",
    "publisher": "Washington State University",
    "releaseDate": "2007-04-01",
    "website": "https://github.com/jhurliman/virtualappraisals"
  }]
}
